using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace OOP2_Practice4
{
    internal static class ExampleData
    {
        public readonly static List<string> stationsExample = new() {
            "Вулиця Титова",
            "ТЦ «Славутич»",
            "Вулиця Гавриленка",
            "Магазин «Затишок»",
            "ТЦ «Юність»",
            "Комбінат «Іграшки»",
            "Проспект Пилипа Орлика",
            "Вулиця Михайла Драгоманова",
            "Магазин «Медтехніка»",
            "Вулиця Ульянова",
            "Проспект Лесі Українки",
            "Вулиця Старокозацька",
            "Театр опери та балету",
            "Театр ім. Тараса Шевченка",
            "Площа Героїв Майдану",
            "Вулиця Барикадна",
            "Історичний музей" };
        public readonly static List<string> publicAnnouncements = new()
        {
            "Шановні пасажири! Кожен придбаний квиток - " +
            "це внесок у розвиток електротранспорту. " +
            "Не залишайте свої квитки в салоні тролейбуса.",
            "Дніпровський електротранспорт запрошує на постійну роботу " +
            "водіїв трамвая, тролейбуса, " +
            "кондукторів громадського транспорту " +
            "та учнів за професією Водій трамвая/тролейбуса. " +
            "Пропонуємо гідну заробітну плату, соціальний пакет. " +
            "Детальна інформація за телефоном 373-92-13.",
            "Шановні пасажири! Якщо ви помітили підозрілі або " +
            "залишені без нагляду предмети, " +
            "сповістіть про це водія або кондуктора."
        };
    }
}
